app/controllers/employees_controller.rb

  def index
    render json: Employee.all
---
SELECT "employees".* FROM "employees" ORDER BY name

  def create
    employee = Employee.create!(employee_params)
---
INSERT INTO "employees" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Jeremiah Tabb"], ["created_at", "2021-09-20 03:53:59.923000"], ["updated_at", "2021-09-20 03:53:59.923000"]]

  def find_employee
    Employee.find(params[:id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]