app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks"
---
  def index
    render json: Task.all

UPDATE "tasks" SET "task_name" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["task_name", "Antigen Developments"], ["updated_at", "2021-09-25 23:44:49.946618"], ["id", 1]]
---
    task = find_task
    task.update(task_params)

DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 4]]
---
    task = find_task
    task.destroy

INSERT INTO "tasks" ("task_name", "public_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["task_name", "efrv"], ["public_id", 34], ["created_at", "2021-09-22 18:51:07.027667"], ["updated_at", "2021-09-22 18:51:07.027667"]]
---
    task = Task.create!(task_params)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def find_task
    Task.find(params[:id])