app/controllers/trainings_controller.rb

  def index
    # render json: Training.all
    render json: Training.order("task_id").order("error_rate_in_english").order("initial_production_rate DESC")
---
SELECT "trainings".* FROM "trainings" ORDER BY task_id, error_rate_in_english, initial_production_rate DESC

  def create
    training = Training.create!(training_params)
---
INSERT INTO "trainings" ("employee_id", "task_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["employee_id", 11], ["task_id", 1], ["created_at", "2021-09-20 03:54:11.510014"], ["updated_at", "2021-09-20 03:54:11.510014"]]